      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMANDS_MOVE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WS-NAME PIC X(16) VALUE "Brunno Lorenzoni".
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY WS-NAME
            STOP RUN.
       END PROGRAM COMMANDS_MOVE.
