      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
      * PROGRAMA PRINCIPAL -> STOP RUN / GOBACK
      * SUB PROGRAMAS/MODULOS -> GOBACK / EXIT PROGRAM / CANCEL
      * RELATORIOS -> TERMINATE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM_END.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "MAIN PROGRAM: STOP RUN / GOBACK".
            DISPLAY "SUB PROGRAM/MODULES -> GOBACK / EXIT PROGRAM / "
           "CANCEL".
            DISPLAY "REPORTS -> TERMINATE".
            STOP RUN.
       END PROGRAM PROGRAM_END.
